Sway-Light/sway-light-ht32f52352/main.c
void wsUpdateMag() {
	if (mode == 2) Light_Animation(Light.slide);		// Light Mode
	else if (mode == 3) Music_Animation(Music.slide);	// Music Mode
	
	startShow = TRUE;
}

void ADC_MainRoutine(void) {
	u8 i;
	u32 total = 0;
	if (gADC_CycleEndOfConversion) {
		if (adcIndex < TEST_LENGTH_SAMPLES) {
			InputSignal[adcIndex] = gADC_Result;
			InputSignal[adcIndex + 1] = 0;
			adcIndex += 2;
		} else {
			if (refFlag == TRUE) {
				for (i = 0; i < TEST_LENGTH_SAMPLES; i += 2) total += InputSignal[i];
				ref_bit = total / (TEST_LENGTH_SAMPLES / 2);
				refFlag = FALSE;
				
//				printf("ref_bit = %d\r\n", ref_bit);
			} else {
				sampleFlag = TRUE;
			}
		}
		gADC_CycleEndOfConversion = FALSE;
	}
}

void RUN_FFT(void) {
	/* Process the data through the CFFT/CIFFT module */
	arm_cfft_f32(&arm_cfft_sR_f32_len64, fftData, ifftFlag, doBitReverse);

	/* Process the data through the Complex Magnitude Module for
	calculating the magnitude at each bin */
	arm_cmplx_mag_f32(fftData, OutputSignal, fftSize);
}

void speakerEnable(bool enable) {
	// Music mute pin
	// Enable  -> low
	// Disable -> high
	GPIO_WriteOutBits(HT_GPIOC, GPIO_PIN_15, (FlagStatus)!enable);
}

void calculateGradient(u8 i1, u8 i2, u8 Fst_color[], u8 Snd_color[]) {
	u8 color_level, color_rgb, value = 0;
	
	for (color_level = i1; color_level <= i2; color_level++) {
		for (color_rgb = 0; color_rgb < 3; color_rgb++) {
			
			if (Snd_color[color_rgb] > Fst_color[color_rgb]) {
				if (i2 > 3) value = Fst_color[color_rgb] + (Snd_color[color_rgb] - Fst_color[color_rgb]) / 4 * (color_level - 4);
				else value = Fst_color[color_rgb] + (Snd_color[color_rgb] - Fst_color[color_rgb]) / 4 * color_level;
			} else if (Snd_color[color_rgb] < Fst_color[color_rgb]) {
				if (i2 > 3) value = Fst_color[color_rgb] - (Fst_color[color_rgb] - Snd_color[color_rgb]) / 4 * (color_level - 4);
				else value = Fst_color[color_rgb] - (Fst_color[color_rgb] - Snd_color[color_rgb]) / 4 * color_level;
			} else {
				value = Fst_color[color_rgb];
			}
			
			musicColor[color_level][color_rgb] = value;
		}
	}
}

void generateMusicColor(u8 level) {
//	u8 color_level;
	u8 color_rgb;
	
	for (color_rgb = 0; color_rgb < 3; color_rgb++) {
		if (level == 0x03) {
			musicColor[0][color_rgb] = low_color[color_rgb];
		} else if (level == 0x02) {
			musicColor[4][color_rgb] = mid_color[color_rgb];
			musicColor[5][color_rgb] = mid_color[color_rgb];
		} else if (level == 0x01) {
			musicColor[9][color_rgb] = high_color[color_rgb];
		}
	}
	
	if (level == 0x03 || level == 0x02) calculateGradient(1, 3, low_color, mid_color);
	if (level == 0x01 || level == 0x02) calculateGradient(6, 8, mid_color, high_color);
	
//	for (color_level = 0; color_level < WS_LEV_SIZE; color_level++) {
//		printf("musicColor[%2d]: ", color_level);
//		for (color_rgb = 0; color_rgb < 3; color_rgb++) {
//			printf("%3d ", musicColor[color_level][color_rgb]);
//		}
//		printf("\r\n");
//	}
}

void DataToESP(u8 category, u8 type) {
	u8 i;
	u16 checksum = 0;
	
	data_to_esp[0] = 0x95; // Start Bit
	data_to_esp[1] = category;
	data_to_esp[2] = type;
	if (category == 0x01) {
		for (i = 3; i <= 6; i++) data_to_esp[i] = 0x00;
	} else if (category == 0x02) {
		if (type == 0x01) {
//			data_to_esp[3] = slideValue;
			for (i = 4; i <= 6; i++) data_to_esp[i] = Color[i - 4];
		} else if (type == 0x03) {
//			data_to_esp[3] = zoomValue;
			for (i = 4; i <= 6; i++) data_to_esp[i] = 0x00;
		} else if (type == 0x05) {
			data_to_esp[3] = Light.offset;
			data_to_esp[4] = Light.zoom;
			
			if (Light.slide <= 0) Light.slide = 0;
			else if (Light.slide >= 100) Light.slide = 100;
			data_to_esp[5] = Light.slide;
			
			data_to_esp[6] = 0x00;
		}
	} else if (category == 0x03) {
		if (type == 0x05) {
			data_to_esp[3] = Music.offset;
			data_to_esp[4] = Music.zoom;
			
			if (Music.slide <= 0) Music.slide = 0;
			else if (Music.slide >= 100) Music.slide = 100;
			data_to_esp[5] = Music.slide;
			
			data_to_esp[6] = 0x00;
		}
	}
	for (i = 1; i <= 6; i++) checksum += data_to_esp[i];
	data_to_esp[7] = checksum >> 8;
	data_to_esp[8] = checksum & 0x00FF;
	data_to_esp[9] = 0x87; // End Bit
	
	printf("Sending: [");
	for (i = 0; i < 10; i++) printf("%02X ", data_to_esp[i]);
	printf("]\r\n");
	
	send_index = 0;
	toEspFlag = TRUE;
	USART_IntConfig(HT_USART0, USART_INT_TXDE, ENABLE);
}

void DataFromESP(u8 command[]) {
	u8 i, data[4];
	
	for (i = 0; i <= 3; i++) data[i] = command[i + 3];
	
	if (command[1] == 0x01) {			// Switching Mode
		printf("Switching Mode: \r\n");
		SwitchingMode(command[2]);
	} else if (command[1] == 0x02) {	// Lighting Mode
		printf("Lighting Mode: \r\n");
		LightingMode(command[2], data);
	} else if (command[1] == 0x03) {	// Music Mode
		printf("Music Mode: \r\n");
		MusicMode(command[2], data);
	} else if (command[1] == 0x04) {	// Setting
		printf("Setting: \r\n");
		Setting(command[2], data);
	}
}

void SwitchingMode(u8 status) {	
	mode = status;
	
	if (mode == 0) {
		On_Effect(20, TRUE);
		speakerEnable(FALSE);
		
		ref_bit = 0;
		refFlag = TRUE;
		
		printf("Turn off\r\n");
	} else if (mode == 1) {
		mode = curr_mode;
//		if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Status Message
		On_Effect(20, FALSE);
		
		adcIndex = 0;
		speakerEnable(TRUE);
		
		wsUpdateMag();
		
		printf("Turn on\r\n");
	} else if (mode == 2) {
		mode = 3;
		Switch_Effect(5, Music.slide);
		mode = 2;
		curr_mode = mode;
		adcIndex = 0;
		
		wsUpdateMag();
	} else if (mode == 3) {
		mode = 2;
		Switch_Effect(5, Light.slide);
		mode = 3;
		curr_mode = mode;
	}
}

void LightingMode(u8 type, u8 data[]) {
	u8 i;
	
	L_Type = type;
	if (L_Type == 0x01) {
		Brightness = data[0];
//		slideValue = Brightness;
		
		for (i = 0; i < 3; i++) Color[i] = data[i + 1];
		
	} else if (L_Type == 0x02) {
//		setLedOffset(data[0]);
	} else if (L_Type == 0x03) {
		zoomValue = data[0];
	} else if (L_Type == 0x05) {
		if (data[0] != Light.offset) {
			Light.offset = data[0];
			setLedOffset(Light.offset);
		}
		if (data[1] != Light.zoom) Light.zoom = data[1];
		if (data[2] != Light.slide) Light.slide = data[2];
	}
	wsUpdateMag();
}

void MusicMode(u8 type, u8 data[]) {
	u8 i;
	
	M_Type = type;
	mLevel = data[0];
	if (M_Type == 0x01) {
		for (i = 0; i < 3; i++) {
			if (mLevel == 0x01) high_color[i] = data[i + 1];
			else if (mLevel == 0x02) mid_color[i] = data[i + 1];
			else if (mLevel == 0x03) low_color[i] = data[i + 1];
		}
		
